import pandas as pd
data=pd.read_excel('学生成绩表.xlsx')
def f1(outfile):
############begin###########################
#显示平均分<60的所有人员信息，填写代码开始
    
##########end###############################
    da1.to_excel(outfile)
def f2(outfile):
############begin###########################
#显示数学分>=90的所有人员姓名和数学成绩信息，填写代码开始
     
##########end###############################
    da2.to_excel(outfile)
def f3(outfile):
############begin###########################
#显示2,3,8行1,3列的信息，填写代码开始
    
##########end###############################
    da3.to_excel(outfile)

